---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.CutLineType.SingleLine
enum: Autodesk.Revit.DB.Architecture.CutLineType
source: html/3dc12e49-711d-cdba-0d16-6b43302a03fd.htm
---
# Autodesk.Revit.DB.Architecture.CutLineType.SingleLine

Cutline type is single-line.